bin/load_test.yml
config:
  # This load test should only need to be run once. We may occasionally
  # need to run it again to verify that the site can handle the load if we are
  # adding new features or making changes to the site.
  target: https://www.luskinoicswingforkids.com/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 200
      - http.response_time.p95: 100
scenarios:
  - flow:
      - loop:
          - get:
              url: "/physicians"
          - get:
              url: "/medical-professionals"
          - get:
              url: "/patient-care"
        count: 100